# Modern CLI tools
brew "bat"          # Better cat
brew "eza"          # Better ls
brew "fd"           # Better find
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Better grep
brew "git-delta"    # Better git diff
brew "zoxide"       # Better cd
brew "tailspin"     # Pretty tail — colorizes log streams (binary: tspin)

# Development tools
brew "direnv"       # Per-directory env auto-loader
brew "neovim"       # Modern vim
brew "starship"     # Fast, minimal prompt
brew "gh"           # GitHub CLI
brew "htop"         # Better top
brew "tealdeer"     # Faster Rust rewrite of tldr (provides `tldr` command)
brew "tmux"         # Terminal multiplexer — persistent sessions over SSH

# Cloud / secrets
brew "awscli"       # AWS CLI
brew "gnupg"        # GPG — commit signing, encryption

# Network utilities
brew "wget"         # Non-interactive HTTP/FTP client
brew "mkcert"       # Local trusted HTTPS certs
brew "wakeonlan"    # Wake LAN devices

# Apps & casks
cask "1password"                       # Password manager (also hosts SSH agent)
cask "1password-cli"                   # `op` CLI
cask "gcloud-cli"                      # Google Cloud CLI
cask "font-jetbrains-mono-nerd-font"   # Terminal font with icons
cask "font-m+-nerd-font"               # Alt nerd font
