# Modern CLI tools
brew "bat"          # Better cat
brew "eza"          # Better ls
brew "fd"           # Better find
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Better grep
brew "git-delta"    # Better git diff
brew "zoxide"       # Better cd
brew "tailspin"     # Pretty tail — colorizes log streams (binary: tspin)

# Development tools
brew "direnv"       # Per-directory env auto-loader
brew "neovim"       # Modern vim
brew "starship"     # Fast, minimal prompt
brew "gh"           # GitHub CLI
brew "htop"         # Better top
brew "tldr"         # Better man pages
brew "tmux"         # Terminal multiplexer — persistent sessions over SSH
